stress_test/stress_test.yml
config:
  target: 'http://sdc-load-balancer-1637658632.us-east-2.elb.amazonaws.com'
  phases:
    - duration: 30
      arrivalRate: 4
      name: "Warm up the application"
    - duration: 10
      arrivalRate: 15
      name: "High load"
    - duration: 30
      arrivalRate: 4
      name: "Normal load"
    - duration: 5
      arrivalRate: 20
      name: "Quick spike"
    - duration: 20
      arrivalRate: 3
      name: "Cool down"
  processor: "./stress_test_funcs.js"

scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/bundle.js"
    - loop:
        - function: "generateRandomArtistId"
        - get:
            url: "/data/toptracks?id={{ query }}"
      count: 35